# **Duplicated Method in Pandas**

---

In [0]:
import pandas as pd

In [3]:
from google.colab import files
upload = files.upload()

Saving employees.csv to employees.csv

In [0]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])

In [0]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [0]:
df['Gender'] = df['Gender'].astype('category')

In [7]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [0]:
df.sort_values('First Name', inplace = True)

In [9]:
df[df['First Name'].duplicated()].head() # Consider first value as unique remaining as duplicate but still show the remaining values as well

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
327      Aaron   Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron   Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron    NaN 1986-01-22  ...  18.424              False  Client Services
141       Adam   Male 1990-12-24  ...  14.727               True          Product
302       Adam   Male 2007-07-05  ...   5.027               True  Human Resources

[5 rows x 8 columns]

In [11]:
df[df['First Name'].duplicated(keep='last')].head() # Consider last value as unique remaining as duplicate but still show the remaining values as well

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron   Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron   Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron   Male 1990-07-22  ...  11.343               True  Client Services
137       Adam   Male 2011-05-21  ...  15.120              False     Distribution
141       Adam   Male 1990-12-24  ...  14.727               True          Product

[5 rows x 8 columns]

In [12]:
df[df['First Name'].duplicated(keep = False)].head() #Show everything

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron   Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron   Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron   Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron    NaN 1986-01-22  ...  18.424              False  Client Services
137       Adam   Male 2011-05-21  ...  15.120              False     Distribution

[5 rows x 8 columns]

In [0]:
mask = ~df['First Name'].duplicated(keep = False) # Show only unique vaues

In [15]:
df[mask]

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]